In [1]:
import pandas as pd
import seaborn as sns

In [2]:
df= sns.load_dataset("titanic")

In [3]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [4]:
lll=['일','이','삼']

In [5]:
df.iloc[:,8]=1

In [6]:
for x in range(len(df)):
    df.iloc[x,8]=lll[x%3]

In [7]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,일,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,이,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,삼,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,일,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,이,man,True,NaN,Southampton,no,True

In [8]:
pd.Series([1,2,3])

0    1
1    2
2    3
dtype: int64